app/views/houses/show.html.erb

SELECT "students".* FROM "students" WHERE "students"."house_id" = $1  [["house_id", 1]]
---

<% @house.students.each do |student| %>